[
    {
        "first_name": "Rias",
        "full_name": "Rias Gremory",
        "anime": "Highschool DxD",
        "characteristics": {
            "affection": 7,
            "strength": 8,
            "intelligence": 9,
            "leadership": 10,
            "charm": 8,
            "magic_power": 9,
            "agility": 7,
            "resilience": 8,
            "courage": 9,
            "combat_skills": 9,
            "strategic_ability": 9,
            "perviness": 10,
            "kindness": 8
        },
        "image_url": "https://i.postimg.cc/c47fXwK1/banner.webp"
    },
    {
        "first_name": "Shoko",
        "full_name": "Shoko Nishimiya",
        "anime": "A Silent Voice",
        "characteristics": {
            "kindness": 9,
            "compassion": 9,
            "forgiveness": 10,
            "memorability": 6,
            "uniqueness": 6,
            "strength": 5,
            "intelligence": 7,
            "leadership": 6,
            "charm": 7,
            "magic_power": 5,
            "agility": 6,
            "resilience": 7,
            "courage": 8,
            "combat_skills": 5,
            "strategic_ability": 6,
            "perviness": 1
        },
        "image_url": "https://i.postimg.cc/vH5tkCKs/Shoko-1.webp",
        "description": "Shoko Nishimiya is the dandere co-star of the dramatic anime movie A Silent Voice. She is a kindhearted and compassionate person who always sees the best in others and will forgive anything, which greatly impressed anime fans, considering all she's been through. Shoko completely forgave Shoya Ishida for bullying her, and she will give him a second chance now that they're older. Shoko is a wonderful waifu and human being, though she also has a lot to figure out about herself and her family's affairs. Shoko Nishimiya is a wonderful character to love in the A Silent Voice movie and has plenty of fans as a realistic, charming anime girl, though she's not memorable or unique enough to beat the industry's best waifus ever. So, Shoko humbly ranks at the bottom of the industry's best."
    },
    {
        "first_name": "Sawako",
        "full_name": "Sawako Kuronuma",
        "anime": "Kimi Ni Todoke",
        "characteristics": {
            "kindness": 8,
            "compassion": 8,
            "friendliness": 9,
            "supportiveness": 9,
            "clarity_in_expression": 7,
            "charm": 7,
            "goofiness": 6,
            "memorability": 7,
            "uniqueness": 7,
            "strength": 5,
            "intelligence": 6,
            "leadership": 5,
            "magic_power": 1,
            "agility": 5,
            "resilience": 7,
            "courage": 7,
            "combat_skills": 1,
            "strategic_ability": 4,
            "perviness": 1
        },
        "description": "Kimi Ni Todoke is a popular shojo romance anime starring the dandere Sawako Kuronuma. She may look like The Ring's villain on the outside, but she is actually a friendly and supportive person who wants to build relationships with her peers and express herself more clearly. Sawako may seem like a fairly conventional shojo lead, but fans still adore her as a gentle, compassionate person who wants what's best for everyone. She can also be charmingly dense or goofy at times, which makes her feel more well-rounded.",
        "image_url": "https://i.postimg.cc/Xv4HsnNm/00274-183771474.jpg"
    },
    {
        "first_name": "Kosaki",
        "full_name": "Kosaki Onodera",
        "anime": "Nisekoi",
        "characteristics": {
            "charm": 8,
            "kindness": 9,
            "gentleness": 9,
            "aggression": 3,
            "brashness": 3,
            "memorability": 8,
            "uniqueness": 7,
            "strength": 5,
            "intelligence": 7,
            "leadership": 5,
            "magic_power": 1,
            "agility": 6,
            "resilience": 7,
            "courage": 7,
            "combat_skills": 1,
            "strategic_ability": 6,
            "perviness": 3
        },
        "image_url": "https://i.postimg.cc/Ssspt6QB/E36v-Gt-TVo-AMg5h-H.jpg",
        "description": "Even if Kosaki Onodera is not part of Nisekoi's main couple, anime fans often like her better than Chitoge Kirisaki because Kosaki is not a typical violent tsundere. Chitoge has her merits, but she can also be annoyingly brash and aggressive, which fans don't usually like. Kosaki is the charming girl next door who runs a sweets shop with her mother and younger sister. Kosaki dearly hoped that she was Raku's promised girl, but no matter which girl has the key to Raku's locket, Nisekoi fans agree that Kosaki—not Chitoge—should end up with Raku as a wonderful waifu and girlfriend."
    },
    {
        "first_name": "Yumeko",
        "full_name": "Yumeko Jabami",
        "anime": "Kakegurui",
        "characteristics": {
            "recklessness": 9,
            "rule_breaking": 10,
            "pleasure_seeking": 8,
            "loyalty": 8,
            "trustworthiness": 8,
            "edginess": 9,
            "beauty": 9,
            "humor": 9,
            "viciousness": 9,
            "memorability": 10,
            "uniqueness": 10,
            "strength": 6,
            "intelligence": 9,
            "leadership": 7,
            "magic_power": 1,
            "agility": 7,
            "resilience": 8,
            "courage": 9,
            "combat_skills": 1,
            "strategic_ability": 9,
            "perviness": 5
        },
        "image_url": "https://i.postimg.cc/RV0X6gp5/bb.webp",
        "description": "Kakegurui is an unusual high school anime series where the sons and daughters of society's elite learn to gamble in high-stakes games of all kinds, so they can practice risk-taking and reading other people. Hyakkou Academy has strict rules and a rigid hierarchy, but then Yumeko Jabami arrives. Yumeko is a whirlwind of reckless gambling, rule-breaking, and gleeful pleasure, and fans love how she's a bull in a china shop while also being a loyal, trusting friend to Ryota and Mary. Yumeko is popular as a somewhat edgy, roguish antihero waifu who is beautiful, funny, and vicious all at once."
    },
    {
        "first_name": "Tohru",
        "full_name": "Tohru Honda",
        "anime": "Fruits Basket",
        "characteristics": {
            "empathy": 10,
            "kindness": 10,
            "patience": 9,
            "caring": 10,
            "supportiveness": 9,
            "courage": 8,
            "friendship": 10,
            "memorability": 9,
            "uniqueness": 8,
            "strength": 6,
            "intelligence": 8,
            "leadership": 7,
            "magic_power": 1,
            "agility": 6,
            "resilience": 9,
            "combat_skills": 1,
            "strategic_ability": 7,
            "perviness": 1
        },
        "image_url": "https://i.postimg.cc/DZSdKgg1/hoe.jpg",
        "description": "Tohru Honda is the heroine of the classic shojo anime Fruits Basket. Her father Katsuya died when she was small, so Tohru was raised by her kind single mother, Kyoko. Growing up, Tohru learned all kinds of life lessons from her doting mom, including the importance of giving other people another chance. Even with Kyoko gone, Tohru still carries the lessons she learned from her mother, which helped inspire her to help the Sohmas, who have curses and personal baggage to deal with. Only with her incredible empathy, kindness, and patience can Tohru help people like Kyo and Yuki break free from their mental prisons. Tohru also made two excellent friends at school, Saki and Arisa, both of whom needed a friend like her."
    },
    {
        "first_name": "Mai",
        "full_name": "Mai Sakurajima",
        "anime": "Rascal Does Not Dream Of Bunny Girl Senpai",
        "characteristics": {
            "tsundere": 9,
            "modesty": 8,
            "disenchantment": 8,
            "loyalty": 9,
            "protectiveness": 9,
            "emotional_complexity": 9,
            "memorability": 7,
            "uniqueness": 8,
            "strength": 7,
            "intelligence": 8,
            "leadership": 7,
            "magic_power": 6,
            "agility": 7,
            "resilience": 8,
            "courage": 8,
            "combat_skills": 5,
            "strategic_ability": 7,
            "perviness": 3
        },
        "image_url": "https://i.postimg.cc/ZKnZzyt4/bb.jpg",
        "description": "Mai Sakurajima from Rascal Does Not Dream Of Bunny Girl Senpai is a lovable tsundere who wants to stay on the down-low despite her status as a model and actress. Her mother forced her into the industry at a very young age, so Mai feels disenchanted since most people only see her for the characters she's played instead of who she really is. Mai's Adolescence Syndrome grants her the anonymity she's always wanted, but it also gradually erases her from existence. However, Sakuta loves her for who she is and helps stop the syndrome from getting worse. Mai may have a cold exterior, but she's loyal and protective of the people she cares about. Fans of emotionally complex characters have plenty to love about Mai, hence her place among the best waifus, though she's not memorable enough to rank that high."
    },
    {
        "first_name": "Asuna",
        "full_name": "Asuna Yuuki",
        "anime": "Sword Art Online",
        "characteristics": {
            "combat_skills": 10,
            "loyalty": 10,
            "friendliness": 9,
            "supportiveness": 9,
            "courage": 9,
            "resilience": 9,
            "memorability": 8,
            "uniqueness": 7,
            "strength": 8,
            "intelligence": 8,
            "leadership": 8,
            "magic_power": 7,
            "agility": 9,
            "strategic_ability": 8,
            "perviness": 2
        },
        "image_url": "https://i.postimg.cc/m2jwCttz/cc.avif",
        "description": "Yuuki is Sword Art Online's Best Girl by a comfortable margin, and she's a great example of a lovable sword-wife character. Like Kirito, Asuna decides to play a virtual fantasy MMORPG, only to get trapped in that digital world. Instead of giving up or grieving other players, though, Asuna toughens up and fights for survival with Kirito. Asuna impresses SAO fans with her ferocious combat skills, her loyalty, and her friendly, supportive personality. She needs Kirito to save her from Oberon, but returns the favor and rescues Kirito from the Underworld despite the danger both in the game world and the real world."
    }
]